from colorama import Fore, Style, init
from datetime import datetime
import os

# Initialize colorama
init(autoreset=True)

def print_banner():
    os.system("cls" if os.name == "nt" else "clear")

    current_time = datetime.now().strftime("%Y-%m-%d %H:%M:%S")

    banner = f"""{Fore.CYAN}

██████╗  █████╗  ██████╗██╗  ██╗███████╗████████╗███████╗██╗  ██╗██╗███████╗██╗     ██████╗ 
██╔══██╗██╔══██╗██╔════╝██║ ██╔╝██╔════╝╚══██╔══╝██╔════╝██║  ██║██║██╔════╝██║     ██╔══██╗
██████╔╝███████║██║     █████╔╝ █████╗     ██║   ███████╗███████║██║█████╗  ██║     ██║  ██║
██╔═══╝ ██╔══██║██║     ██╔═██╗ ██╔══╝     ██║   ╚════██║██╔══██║██║██╔══╝  ██║     ██║  ██║
██║     ██║  ██║╚██████╗██║  ██╗███████╗   ██║   ███████║██║  ██║██║███████╗███████╗██████╔╝
╚═╝     ╚═╝  ╚═╝ ╚═════╝╚═╝  ╚═╝╚══════╝   ╚═╝   ╚══════╝╚═╝  ╚═╝╚═╝╚══════╝╚══════╝╚═════╝ 

{Fore.MAGENTA}                     PacketShield v1.0 | Integrated Network IDS & IPS
{Fore.YELLOW}                      Real-Time Threat Detection & Prevention System
{Fore.GREEN}                               Started at: {current_time}

{Fore.BLUE}================================================================================
{Style.RESET_ALL}
"""
    
    print(banner)